/* eslint-disable max-len */
import SvgIcon from '@material-ui/core/SvgIcon';
import React from 'react';

export default ({ className }) => (
  <SvgIcon viewBox='0 0 40.806 41.357' className={className}>
    <path id='Контур_170' data-name='Контур 170' d='M1232.872,542.205h-1.5a16.839,16.839,0,1,1-4.932-11.906,16.778,16.778,0,0,1,4.932,11.906h3a19.838,19.838,0,1,0-19.838,19.838,19.838,19.838,0,0,0,19.838-19.838Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_171' data-name='Контур 171' d='M1216.034,560.058v-2.7a1.5,1.5,0,0,0-3,0v2.7a1.5,1.5,0,0,0,3,0Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_172' data-name='Контур 172' d='M1216.034,527.058v-2.7a1.5,1.5,0,0,0-3,0v2.7a1.5,1.5,0,0,0,3,0Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_173' data-name='Контур 173' d='M1232.387,540.705h-2.706a1.5,1.5,0,0,0,0,3h2.706a1.5,1.5,0,0,0,0-3Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_174' data-name='Контур 174' d='M1199.387,540.705h-2.706a1.5,1.5,0,0,0,0,3h2.706a1.5,1.5,0,0,0,0-3Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_175' data-name='Контур 175' d='M1216.034,542.055V531.417a1.5,1.5,0,0,0-3,0v10.638A1.5,1.5,0,0,0,1216.034,542.055Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_176' data-name='Контур 176' d='M1214.534,543.712h8.2a1.5,1.5,0,0,0,0-3h-8.2A1.5,1.5,0,0,0,1214.534,543.712Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_177' data-name='Контур 177' d='M1218.349,541.912a3.612,3.612,0,1,1-3.611-3.611A3.612,3.612,0,0,1,1218.349,541.912Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <circle id='Эллипс_23' data-name='Эллипс 23' cx='6.26' cy='6.26' r='6.26' transform='translate(0 4.791) rotate(-22.5)' fill='#ffeed5' />
    <path id='Контур_178' data-name='Контур 178' d='M1195.485,529.694h1.5a4.759,4.759,0,1,1,1.394,3.365,4.74,4.74,0,0,1-1.394-3.365h-3a7.76,7.76,0,1,0,7.759-7.76,7.759,7.759,0,0,0-7.759,7.76Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_179' data-name='Контур 179' d='M1200.058,530.385h4.712a.691.691,0,0,0,0-1.382h-4.712A.691.691,0,0,0,1200.058,530.385Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_180' data-name='Контур 180' d='M1202.021,532.018l-2.813-2.813v.978l2.813-2.813a.692.692,0,0,0-.978-.978l-2.813,2.813a.7.7,0,0,0,0,.978l2.813,2.813A.692.692,0,0,0,1202.021,532.018Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <circle id='Эллипс_24' data-name='Эллипс 24' cx='6.26' cy='6.26' r='6.26' transform='translate(0 29.791) rotate(-22.5)' fill='#ffeed5' />
    <path id='Контур_181' data-name='Контур 181' d='M1208,554.694h-1.5a4.759,4.759,0,1,1-1.394-3.366,4.736,4.736,0,0,1,1.394,3.366h3a7.76,7.76,0,1,0-7.76,7.759,7.759,7.759,0,0,0,7.76-7.759Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
    <path id='Контур_182' data-name='Контур 182' d='M1201.811,552.777l.837-.926a.192.192,0,0,1,.334.138l-.063,1.247a.192.192,0,0,0,.2.2l1.247-.064a.192.192,0,0,1,.138.334l-.926.837v.285l.926.837a.192.192,0,0,1-.138.334l-1.247-.064a.192.192,0,0,0-.2.2l.063,1.247a.192.192,0,0,1-.334.138l-.837-.926h-.285l-.837.926a.192.192,0,0,1-.334-.138l.064-1.247a.193.193,0,0,0-.2-.2l-1.247.064a.192.192,0,0,1-.138-.334l.926-.837v-.285l-.926-.837a.192.192,0,0,1,.138-.334l1.247.064a.193.193,0,0,0,.2-.2l-.064-1.247a.192.192,0,0,1,.334-.138l.837.926Z' transform='translate(-1193.566 -521.516)' fill='#faac2e' />
  </SvgIcon>
);
