/* eslint-disable max-len */
import SvgIcon from '@material-ui/core/SvgIcon';
import React from 'react';

export default ({ className }) => (
  <SvgIcon viewBox='0 0 40.806 40.937' className={className}>
    <path id='Контур_65' data-name='Контур 65' d='M1195.485,642.205h-1.5a19.838,19.838,0,1,0,19.838-19.838,19.838,19.838,0,0,0-19.838,19.838h3a16.839,16.839,0,1,1,4.932,11.907,16.778,16.778,0,0,1-4.932-11.907Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_66' data-name='Контур 66' d='M1215.323,660.058v-2.7a1.5,1.5,0,0,0-3,0v2.7a1.5,1.5,0,0,0,3,0Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_67' data-name='Контур 67' d='M1215.323,627.058v-2.7a1.5,1.5,0,0,0-3,0v2.7a1.5,1.5,0,0,0,3,0Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_68' data-name='Контур 68' d='M1195.971,643.705h2.705a1.5,1.5,0,0,0,0-3h-2.705a1.5,1.5,0,0,0,0,3Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_69' data-name='Контур 69' d='M1228.971,643.705h2.705a1.5,1.5,0,0,0,0-3h-2.705a1.5,1.5,0,0,0,0,3Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_70' data-name='Контур 70' d='M1215.323,642.055V631.417a1.5,1.5,0,0,0-3,0v10.638A1.5,1.5,0,0,0,1215.323,642.055Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_71' data-name='Контур 71' d='M1213.823,640.712h-8.2a1.5,1.5,0,0,0,0,3h8.2A1.5,1.5,0,0,0,1213.823,640.712Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_72' data-name='Контур 72' d='M1210.008,641.912a3.611,3.611,0,1,0,3.611-3.611A3.612,3.612,0,0,0,1210.008,641.912Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <circle id='Эллипс_13' data-name='Эллипс 13' cx='6.26' cy='6.26' r='6.26' transform='matrix(0.987, -0.16, 0.16, 0.987, 25.446, 2.583)' fill='#ffeed5' />
    <path id='Контур_73' data-name='Контур 73' d='M1232.872,629.694h1.5a7.759,7.759,0,1,0-7.759,7.759,7.758,7.758,0,0,0,7.759-7.759h-3a4.759,4.759,0,1,1-1.394-3.366,4.736,4.736,0,0,1,1.394,3.366Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_74' data-name='Контур 74' d='M1228.3,629h-4.713a.691.691,0,0,0,0,1.382h4.713A.691.691,0,0,0,1228.3,629Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_75' data-name='Контур 75' d='M1227.314,633l2.813-2.813a.7.7,0,0,0,0-.978l-2.813-2.813a.692.692,0,0,0-.978.978l2.813,2.813v-.978l-2.813,2.813A.692.692,0,0,0,1227.314,633Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <circle id='Эллипс_14' data-name='Эллипс 14' cx='6.26' cy='6.26' r='6.26' transform='translate(24.449 29.371) rotate(-22.5)' fill='#ffeed5' />
    <path id='Контур_76' data-name='Контур 76' d='M1232.872,654.694h-1.5a4.759,4.759,0,1,1-1.394-3.366,4.736,4.736,0,0,1,1.394,3.366h3a7.759,7.759,0,1,0-7.759,7.759,7.758,7.758,0,0,0,7.759-7.759Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_77' data-name='Контур 77' d='M1228.382,655.77a2.817,2.817,0,0,1-2.611-3.875l.019-.045-.041.018a2.817,2.817,0,1,0,3.725,3.705l.011-.027-.029.012A2.8,2.8,0,0,1,1228.382,655.77Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
    <path id='Контур_78' data-name='Контур 78' d='M1228.382,655.42a2.5,2.5,0,0,1-2.255-3.477c.134-.322-.275-.5-.514-.4a3.166,3.166,0,1,0,4.175,4.174c.1-.238-.073-.649-.4-.514a2.735,2.735,0,0,1-1.01.212c-.448.03-.451.73,0,.7a3.58,3.58,0,0,0,1.2-.237l-.4-.514a2.47,2.47,0,1,1-3.217-3.217l-.514-.395a3.2,3.2,0,0,0,2.93,4.363C1228.834,656.143,1228.832,655.443,1228.382,655.42Z' transform='translate(-1193.985 -621.935)' fill='#faac2e' />
  </SvgIcon>
);
